#text01 = вы хотите снизить вес, для этого вам нужно:...

text01 = '''1. План питания для снижения веса (Дефицит калорий)

Основная задача — запустить процесс жиросжигания, максимально сохранив мышечную массу. Для этого необходимо обеспечить организм повышенным количеством белка.

Рекомендация: 2–2.5 г белка на кг мышечной массы.

Источники нутриентов:

· Белок: Курица, индейка, красное мясо (говядина), красная рыба (лосось), яйца, творог, протеин.
· Углеводы: Гречка, рис, макароны из твердых сортов пшеницы, овсянка. Потребление сосредоточьте вокруг тренировок.
· Жиры: Орехи, оливковое масло. Потребление умеренное, для поддержания гормонального фона.
· Клетчатка: Для контроля калорийности и чувства сытости добавляйте в рацион большое количество овощей.'''


text02 = '''2. План питания для набора массы (Профицит калорий)

Цель — обеспечить организм энергией и материалами для роста мышечной ткани. Ключевым фактором является общий калораж.

Рекомендация: 1.8–2.5 г белка на кг мышечной массы.

Источники нутриентов:

· Углеводы — основа энергии: Рост массы происходит преимущественно за счет увеличения доли углеводов. Источники: крупы, макароны, хлеб, хлопья, картофель, фрукты.
· Белок: Те же источники, что и при снижении веса.
· Жиры: Те же источники, что и при снижении веса, но без чрезмерного употребления.'''


text03 = '''3. Рекомендации по восстановлению

Сон: Необходимая продолжительность — 7–9 часов в сутки. Рекомендуется засыпать до 23:00. 
Качественный сон обеспечивает выработку гормона роста и снижает уровень кортизола, 
что критично для восстановления и прогресса.'''




text04 = '''4. Программа тренировок (3 дня в неделю)

Программа построена на упражнениях с собственным весом и резиновыми эспандерами для развития мышечного корсета и силовых показателей.

Расписание: Пн – Ср – Пт или Вт – Чт – Сб.

День 1: Грудь, Плечи, Трицепс (PUSH)

1. Отжимания с резиной – 3 подхода по 8-12 повторений.
2. Жим с резиной стоя/сидя – 3 подхода по 10-15 повторений.
3. Разводки с резиной на грудь – 3 подхода по 12-15 повторений.
4. Отжимания на трицепс с резиной – 3 подхода по 10-15 повторений.

День 2: Спина, Бицепс (PULL)

1. Подтягивания/Австралийские подтягивания с резиной – 3 подхода до мышечного отказа.
2. Тяга резины к поясу – 3 подхода по 12-15 повторений.
3. Тяга резины к лицу – 3 подхода по 12-15 повторений.
4. Сгибания на бицепс с резиной – 3 подхода по 12-15 повторений.

День 3: Ноги и Кор

1. Приседания с резиной над коленями – 3 подхода по 12-15 повторений.
2. Выпады с резиной – 3 подхода по 10-12 повторений на каждую ногу.
3. Ягодичный мостик с резиной – 3 подхода по 15-20 повторений.
4. Подъемы ног лежа – 3 подхода по 15-20 повторений.
5. Скручивания на турнике'''

day11 = '''day11'''
day12 = '''day12'''
day13 = '''day13'''

day21 = '''day21'''
day22 = '''day22'''
day23 = '''day23'''

day31 = '''day31'''
day32 = '''day32'''
day33 = '''day33'''

day41 = '''day41'''
day42 = '''day42'''
day43 = '''day43'''

day51 = '''day51'''
day52 = '''day52'''
day53 = '''day53'''

day61 = '''day61'''
day62 = '''day62'''
day63 = '''day63'''

training_week1 = [day11, day12, day13]

training_week2 = [day21, day22, day23]

training_week3 = [day31, day32, day33]

training_week4 = [day41, day42, day43]

training_week5 = [day51, day52, day53]

training_week6 = [day61, day62, day63]

weeks = [
    training_week1,
    training_week2,
    training_week3,
    training_week4,
    training_week5,
    training_week6
]

text_technique_arms = '''текст для техники тренировок (рук)'''

text_technique_body = '''текст для техники тренировок (спины)'''

text_technique_legs = '''текст для техники тренировок (ног)'''